wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
/** @file stm32f4xx_usb_fs.c
 * \brief Driver for STM32F4x5/4x7 device
 *
 * This driver is written according to STM32F4x5_4x7 reference manual
 * (ref. RM0090) Rev 11.
 **/

//#include "cortex_m_functions.h"
//#include "debug.h"
//#include "stm32f4xx_exti.h"
#include "autoconf.h"
#ifdef CONFIG_USR_DRV_USB_FS
#include "api/syscall.h"
#include "api/print.h"

/*
 * This should be replaced in Kconfig and source:
 * - both fs and hs mode in the same driver
 */
#include "stm32f4xx_usb_fs.h"

//#include "stm32f4xx_gpio_goodusb.h"
//#include "stm32f4xx_nvic.h"
#include "stm32f4xx_usb_fs.h"
#include "stm32f4xx_usb_fs_regs.h"
#include "api/usb_control.h"
#include "api/usb.h"
#define ZERO_LENGTH_PACKET 0
#define OUT_NAK		0x01
#define DataOUT		0x02
#define Data_Done	0x03
#define SETUP_Done	0x04
#define SETUP		0x06

#define USB_REG_CHECK_TIMEOUT 50

#define USB_FS_RX_FIFO_SZ       128
#define USB_FS_TX_FIFO_SZ       128

/**
 * \struct setup_packet
 * \brief Setup packet, used to transfer data on EP0
 */
static struct {
	void (*data_sent_callback)(void);
	void (*data_received_callback)(uint32_t);
} usb_fs_callbacks;

static uint8_t 	setup_packet[8];


static volatile uint8_t *buffer_ep0;
static volatile uint32_t buffer_ep0_idx;
static volatile uint32_t buffer_ep0_size;
static volatile uint8_t *buffer_ep1;
static volatile uint32_t buffer_ep1_idx;
static volatile uint32_t buffer_ep1_size;


void OTG_FS_IRQHandler(uint8_t irq __UNUSED, // IRQ number
                       uint32_t sr,  // content of posthook.status,
                       uint32_t dr);  // content of posthook.data)

#define GPIO_AF10_OTG_FS	0xA

#define USB_MAX_ISR 32

static usb_ep_error_t usb_fs_driver_TXFIFO_flush(uint8_t ep){
    uint32_t count = 0;
	/* Select which ep to flush and do it
     * This is the FIFO number that must be flushed using the TxFIFO Flush bit.
     * This field must not be changed until the core clears the TxFIFO Flush bit.
     */
    count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_TXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:TXFFLSH\n");
        return -USB_ERROR_BUSY;
    }
    /*
     * The application must write this bit only after checking that the core is neither writing to the
     * TxFIFO nor reading from the TxFIFO. Verify using these registers:
     */

    /* FIXME Read: the NAK effective interrupt ensures the core is not reading from the FIFO */

    /* Write: the AHBIDL bit in OTG_HS_GRSTCTL ensures that the core is not writing anything to the FIFO */
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, ep, USB_FS_GRSTCTL_TXFNUM);
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, 1, USB_FS_GRSTCTL_TXFFLSH);
    count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_TXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:TXFFLSH\n");
        return -USB_ERROR_BUSY;
    }
    return 0;
}

static usb_ep_error_t usb_fs_driver_RXFIFO_flush(void){
    uint32_t count = 0;
	/* Select which ep to flush and do it
     * This is the FIFO number that must be flushed using the TxFIFO Flush bit.
     * This field must not be changed until the core clears the TxFIFO Flush bit.
     */
    count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_RXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! Waiting for the core to clear the TxFIFO Flush bit GRSTCTL:RXFFLSH\n");
        return -USB_ERROR_BUSY;
    }
    /*
     * The application must write this bit only after checking that the core is neither writing to the
     * RxFIFO nor reading from the RxFIFO. Verify using these registers:
     */

    /* FIXME Read: the NAK effective interrupt ensures the core is not reading from the FIFO */

    /* Write: the AHBIDL bit in OTG_HS_GRSTCTL ensures that the core is not writing anything to the FIFO */
	//set_reg(r_CORTEX_M_USB_FS_GRSTCTL, ep, USB_FS_GRSTCTL_RXFNUM);
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, 1, USB_FS_GRSTCTL_RXFFLSH);
    count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_RXFFLSH)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! Waiting for the core to clear the RxFIFO Flush bit GRSTCTL:TXFFLSH\n");
        return -USB_ERROR_BUSY;
    }
    return 0;
}


void usb_fs_driver_device_connect(void){
    set_reg(r_CORTEX_M_USB_FS_DCTL, 0, USB_FS_DCTL_SDIS);
}

/**
 *
 * The powered state can be exited by software with the soft disconnect feature. The DP pullup
 * resistor is removed by setting the soft disconnect bit in the device control register (SDIS
 * bit in OTG_FS_DCTL), causing a device disconnect detection interrupt on the host side
 * even though the USB cable was not really removed from the host port.
 */
void usb_fs_driver_device_disconnect(void){
    set_reg(r_CORTEX_M_USB_FS_DCTL, 1, USB_FS_DCTL_SDIS);
}


static const char *name = "usb-otg-fs";

static uint8_t usb_device_early_init(void) {

    e_syscall_ret ret = 0;
    device_t dev;
    memset((void*)&dev, 0, sizeof(device_t));
    int      dev_desc = 0;

    memcpy(dev.name, name, strlen(name));
    dev.address = USB_OTG_FS_BASE;
    dev.size = 0x4000;
    dev.irq_num = 1;

    /* IRQ configuration */
    dev.irqs[0].handler = OTG_FS_IRQHandler;
    dev.irqs[0].irq = 0x53; /* starting with STACK */
    dev.irqs[0].mode = IRQ_ISR_FORCE_MAINTHREAD; /* if ISR force MT immediat execution, use FORCE_MAINTHREAD instead of STANDARD, and activate FISR permission */

    /*
     * IRQ posthook configuration
     * The posthook is executed at the end of the IRQ handler mode, *before* the ISR.
     * It permit to clean potential status registers (or others) that may generate IRQ loops
     * while the ISR has not been executed.
     * register read can be saved into 'status' and 'data' and given to the ISR in 'sr' and 'dr' argument
     */
    dev.irqs[0].posthook.status = 0x0014; /* SR is first read */
    dev.irqs[0].posthook.data = 0x0018; /* Data reg  is 2nd read */


    dev.irqs[0].posthook.action[0].instr = IRQ_PH_READ;
    dev.irqs[0].posthook.action[0].read.offset = 0x0014;


    dev.irqs[0].posthook.action[1].instr = IRQ_PH_READ;
    dev.irqs[0].posthook.action[1].read.offset = 0x0018;


    dev.irqs[0].posthook.action[2].instr = IRQ_PH_MASK;
    dev.irqs[0].posthook.action[2].mask.offset_dest = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.offset_mask = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[2].mask.mode = 0; /* no binary inversion */


    dev.irqs[0].posthook.action[3].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[3].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.mask = USB_FS_GINTMSK_RXFLVLM_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[3].and.mode = 1; /* binary inversion */


    dev.irqs[0].posthook.action[4].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[4].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.mask = USB_FS_GINTMSK_IEPINT_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[4].and.mode = 1; /* binary inversion */


    dev.irqs[0].posthook.action[5].instr = IRQ_PH_AND;
    dev.irqs[0].posthook.action[5].and.offset_dest = 0x18; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.offset_src = 0x14; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.mask = USB_FS_GINTMSK_OEPINT_Msk; /* MASK register offset */
    dev.irqs[0].posthook.action[5].and.mode = 1; /* binary inversion */



    /* Now let's configure the GPIOs */
    dev.gpio_num = 4;

	/* SOF -> PA 8 */
    dev.gpios[0].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[0].kref.port    = GPIO_PA;
    dev.gpios[0].kref.pin     = 8;
    dev.gpios[0].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[0].pupd         = GPIO_NOPULL;
    dev.gpios[0].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[0].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[0].afr          = GPIO_AF_OTG_FS;
	/* VBUS -> PA 9 */
    dev.gpios[1].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[1].kref.port    = GPIO_PA;
    dev.gpios[1].kref.pin     = 9;
    dev.gpios[1].mode         = GPIO_PIN_INPUT_MODE;
    dev.gpios[1].pupd         = GPIO_NOPULL;
    dev.gpios[1].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[1].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[1].afr          = GPIO_AF_OTG_FS;

