wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
	/* DM pin -> PA11 */
    dev.gpios[2].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[2].kref.port    = GPIO_PA;
    dev.gpios[2].kref.pin     = 11;
    dev.gpios[2].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[2].pupd         = GPIO_NOPULL;
    dev.gpios[2].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[2].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[2].afr          = GPIO_AF_OTG_FS;

	/* DP pin -> PA12 */
    dev.gpios[3].mask         = GPIO_MASK_SET_MODE | GPIO_MASK_SET_PUPD | GPIO_MASK_SET_TYPE | GPIO_MASK_SET_SPEED | GPIO_MASK_SET_AFR;
    dev.gpios[3].kref.port    = GPIO_PA;
    dev.gpios[3].kref.pin     = 12;
    dev.gpios[3].mode         = GPIO_PIN_ALTERNATE_MODE;
    dev.gpios[3].pupd         = GPIO_NOPULL;
    dev.gpios[3].type         = GPIO_PIN_OTYPER_PP;
    dev.gpios[3].speed        = GPIO_PIN_VERY_HIGH_SPEED;
    dev.gpios[3].afr          = GPIO_AF_OTG_FS;

    ret = sys_init(INIT_DEVACCESS, &dev, &dev_desc);
    return ret;
}


static uint16_t size_from_mpsize(usb_ep_t *ep){
    if (ep->max_packet_size == USB_FS_D0EPCTL_MPSIZ_64BYTES){
        return 64;
    }
    if (ep->max_packet_size == USB_FS_D0EPCTL_MPSIZ_32BYTES){
        return 32;
    }
    if (ep->max_packet_size == USB_FS_D0EPCTL_MPSIZ_16BYTES){
        return 16;
    }
    if (ep->max_packet_size == USB_FS_D0EPCTL_MPSIZ_8BYTES){
        return 8;
    }
    return ep->max_packet_size;
}





/**
 * \brief IN Endpoint activation
 *
 *    This section describes the steps required to activate a device endpoint or to configure an
 *    existing device endpoint to a new type.
 *    1. Program the characteristics of the required endpoint into the following fields of the
 *    OTG_FS_DIEPCTLx register (for IN or bidirectional endpoints)
 *      – Maximum packet size
 *      – USB active endpoint = 1
 *      – Endpoint start data toggle (for interrupt and bulk endpoints)
 *      – Endpoint type
 *      – TxFIFO number
 *
 *    2. Once the endpoint is activated, the core starts decoding the tokens addressed to that
 *    endpoint and sends out a valid handshake for each valid token received for the
 *    endpoint.
 *
 */
usb_ep_error_t usb_fs_driver_in_endpoint_activate(usb_ep_t *ep)
{
    /* Sanitization check */
    if (!ep) {
        printf("EP%d is not initialized \n", ep->num);
        return -USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is already active */
    if (get_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), USB_FS_DIEPCTL_EPENA)) {
        return -USB_ERROR_ALREADY_ACTIVE;
    }

	/* Maximum packet size */
    if ((size_from_mpsize(ep) <= 0) || size_from_mpsize(ep) > MAX_DATA_PACKET_SIZE) {
        printf("EP%d bad maxpacket size: %d\n", ep->num, size_from_mpsize(ep));
        return -USB_ERROR_RANGE;
    }

	set_reg_value(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), ep->max_packet_size,
                                                      USB_FS_DIEPCTL_MPSIZ_Msk(ep->num),
                                                      USB_FS_DIEPCTL_MPSIZ_Pos(ep->num));
    /* Define endpoint type */
    if (ep->type == USB_FS_DXEPCTL_EPTYP_ISOCHRO) {
        printf("EP%d Isochronous is not suported yet\n", ep->num);
        return -USB_ERROR_NOT_SUPORTED;
    }

	set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), ep->type, USB_FS_DIEPCTL_EPTYP);


    /* Endpoint start data toggle (for interrupt and bulk endpoints)
     * The application uses the SD0PID/SD1PID register fields to program either DATA0 or DATA1 PID.
     *   0: DATA0
     *   1: DATA1
     */
    if ((ep->type == USB_FS_DXEPCTL_EPTYP_INT) || (ep->type == USB_FS_DXEPCTL_EPTYP_BULK)){
        if (ep->start_data_toggle == USB_FS_DXEPCTL_SD0PID_SEVNFRM) {
	        set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), 1, USB_FS_DIEPCTL_SD0PID);
        }else{
            set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), 1, USB_FS_DIEPCTL_SD1PID);
        }
    }

    /* USB active endpoint
     * Indicates whether this endpoint is active in the current configuration and interface. The core
     * clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After receiving
     * the SetConfiguration and SetInterface commands, the application must program endpoint registers
     * accordingly and set this bit.
     */
	set_reg_bits(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), USB_FS_DIEPCTL_USBAEP_Msk);


    /*  IN endpoint FIFOx transmit RAM start address
     *  XXX sould be set by user ?
     */
     /* FIXME add an allocator allowing to compact memory without holes*/
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF(ep->num), (128 * 4)*ep->num + (128 * 4)*2, USB_FS_DIEPTXF_INEPTXSA);


    /*  IN endpoint TxFIFO depth
     *  XXX sould be set by user ?
     */
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF(ep->num), 128, USB_FS_DIEPTXF_INEPTXFD);

    /* Clearing the NAK bit for the endpoint */
    set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep->num), ep->num, USB_FS_DIEPCTL_CNAK);


    /* Unmask IN endpoint global interrupt */
	set_reg_bits(r_CORTEX_M_USB_FS_GINTMSK, USB_FS_GINTMSK_IEPINT_Msk);

    /* IN EP interrupt mask bits
     *   The OTG_FS_DAINTMSK register works with the Device endpoint interrupt register to
     *   interrupt the application when an event occurs on a device endpoint.
     *   However, the OTG_FS_DAINT register bit corresponding to that interrupt is still set.
     */
	write_reg_value(r_CORTEX_M_USB_FS_DAINTMSK, USB_FS_DAINTMSK_IEPM(ep->num));

    return USB_OK;
}

/**
 * \brief Out Endpoint deactivation
 *
 *    This section describes the steps required to deactivate an existing endpoint.
 *    1. In the endpoint to be deactivated, clear the USB active endpoint bit in the
 *       OTG_FS_DIEPCTLx register (for IN or bidirectional endpoints) or the
 *       OTG_FS_DOEPCTLx register (for OUT or bidirectional endpoints).
 *    2. Once the endpoint is deactivated, the core ignores tokens addressed to that endpoint,
 *       which results in a timeout on the USB.
 *
 *    Note: The application must meet the following conditions to set up the device core to handle
 *          traffic: NPTXFEM and RXFLVLM in the OTG_FS_GINTMSK register must be cleared
 */
usb_ep_error_t usb_fs_driver_out_endpoint_deactivate(uint8_t ep){

    /* Sanitization check */
    if ((ep <= 0) || (ep > 3)) {
        return -USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is active */
    if (get_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), USB_FS_DOEPCTL_EPENA)) {
        set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_EPENA);
        set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_SNAK);
	    set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_EPDIS);
    }
    return USB_OK;
}

/**
 * \brief IN Endpoint deactivation
 *
 *    This section describes the steps required to deactivate an existing endpoint.
 *    1. In the endpoint to be deactivated, clear the USB active endpoint bit in the
 *       OTG_FS_DIEPCTLx register (for IN or bidirectional endpoints) or the
 *       OTG_FS_DOEPCTLx register (for OUT or bidirectional endpoints).
 *    2. Once the endpoint is deactivated, the core ignores tokens addressed to that endpoint,
 *       which results in a timeout on the USB.
 *
 *    Note: The application must meet the following conditions to set up the device core to handle
 *          traffic: NPTXFEM and RXFLVLM in the OTG_FS_GINTMSK register must be cleared
 */
usb_ep_error_t usb_fs_driver_in_endpoint_deactivate(uint8_t ep){

    /* Sanitization check */
    if ((ep <= 0) || (ep > 3)) {
        return -USB_ERROR_BAD_INPUT;
    }

    /* Checking if enpoint is active */
    if (get_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), USB_FS_DIEPCTL_EPENA)) {
        set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_EPENA);
	    set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_SNAK);
	    set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_EPDIS);

