wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
    }
    return USB_OK;
}



/**
 * \brief Nack OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_fs_driver_global_nack_out(){
	/* Put core in Global OUT NAK mode
     *   A write to this field sets the Global OUT NAK.
     *   The application uses this bit to send a NAK handshake on all OUT endpoints.
     *
     *   FIXME The application must set the this bit only after making sure that the Global OUT NAK
     *   effective bit in the Core interrupt register (GONAKEFF bit in OTG_FS_GINTSTS) is cleared.
     */
	set_reg(r_CORTEX_M_USB_FS_DCTL, 1, USB_FS_DCTL_SGONAK);

}


/**
 * \brief Nack OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_fs_driver_clear_global_nack_out(){
	/* A write to this field clears the Global OUT NAK. */
	set_reg(r_CORTEX_M_USB_FS_DCTL, 1, USB_FS_DCTL_CGONAK);

}


/**
 * \brief Nack IN endpoint
 *
 * @param ep Endpoint
 */
void usb_fs_driver_global_nack_in(){
	/* Set global IN NAK
     *   A write to this field sets the Global non-periodic IN NAK.The application uses this bit to send
     *   a NAK handshake on all non-periodic IN endpoints.
     *   The application must set this bit only after making sure that the Global IN NAK effective bit
     *   in the Core interrupt register (GINAKEFF bit in OTG_FS_GINTSTS) is cleared.
     */
	set_reg(r_CORTEX_M_USB_FS_DCTL, 1, USB_FS_DCTL_SGINAK);
}


/**
 * \brief Nack IN endpoint
 *
 * @param ep Endpoint
 */
void usb_fs_driver_clear_global_nack_in(){

	/* A write to this field clears the Global IN NAK. */
	set_reg(r_CORTEX_M_USB_FS_DCTL, 1, USB_FS_DCTL_CGINAK);

}


/**
 * \brief Stall OUT endpoint
 *
 * @param ep Endpoint
 */
void usb_fs_driver_stall_out(uint8_t ep){

    /* Wait for current transmission to END */
    while (get_reg_value(r_CORTEX_M_USB_FS_DOEPCTL(ep), USB_FS_DOEPCTL_EPENA_Msk, USB_FS_DOEPCTL_EPENA_Pos)){
        continue; //FIXME TIMEOUT
    }
	/* Disable OUT EP and set STALL bit */
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_EPDIS);
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_STALL);

	/* Clear STALL bit when app is ready */
	/* On Ctrl 0, this is done when request or data are received */
}


/**
 * \brief Stall IN endpoint
 *
 * @param ep Endpoint
 */
usb_ep_error_t usb_fs_driver_stall_in(uint8_t ep){

    /* Wait for current transmission to END */
    //while (get_reg_value(r_CORTEX_M_USB_FS_DIEPCTL(ep), USB_FS_DIEPCTL_EPENA_Msk, USB_FS_DIEPCTL_EPENA_Pos)){
    //    continue; //FIXME TIMEOUT
    //}
    int count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), USB_FS_DIEPCTL_EPENA)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! DIEPCTL:EPENA\n");
        return -USB_ERROR_BUSY;
    }

	/* Disable IN EP and set STALL bit */
	set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_EPDIS);
	set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_STALL);

	/* Assert on Endpoint Disabled interrupt */
	assert(read_reg_value(r_CORTEX_M_USB_FS_DIEPINT(ep)) & USB_FS_DIEPINT_EPDISD_Msk);

	/* Flush transmit FIFO
	 * p1279 Rev14 RM0090
	 * Read NAK Eff Int and write AHBIL bit
	 */
	//while (read_reg_value(r_CORTEX_M_USB_FS_GINTSTS) & USB_FS_GINTSTS_GINAKEFF_Msk);
    count = 0;
	while (get_reg(r_CORTEX_M_USB_FS_GINTSTS, USB_FS_GINTSTS_GINAKEFF)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! GINTSTS:GINAKEFF\n");
        return -USB_ERROR_BUSY;
    }

	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, 1, USB_FS_GRSTCTL_AHBIDL);

	/* Select which ep to flush and do it */
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, ep, USB_FS_GRSTCTL_TXFNUM);
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, 1, USB_FS_GRSTCTL_TXFFLSH);

	/* Clear STALL bit */
	/* On Ctrl 0, this is done when request is received */
    return 0;
}


/**
 *
 */
void usb_fs_driver_stall_in_clear(uint8_t ep, uint8_t type, uint8_t start_data_toggle){

	/* Clear STALL bit */
	set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 0, USB_FS_DIEPCTL_STALL);

    /* Reset PID */
    if ((type == USB_FS_DXEPCTL_EPTYP_INT) || (type == USB_FS_DXEPCTL_EPTYP_BULK)){
        if (start_data_toggle == USB_FS_DXEPCTL_SD0PID_SEVNFRM) {
	        set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_SD0PID); /* DATA0 */
        }else{
            set_reg(r_CORTEX_M_USB_FS_DIEPCTL(ep), 1, USB_FS_DIEPCTL_SD1PID); /* DATA1 */
        }
    }
}

/**
 *
 */
void usb_fs_driver_stall_out_clear(uint8_t ep, uint8_t type, uint8_t start_data_toggle){

	/* Clear STALL bit */
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 0, USB_FS_DIEPCTL_STALL);

    /* Reset PID */
    if ((type == USB_FS_DXEPCTL_EPTYP_INT) || (type == USB_FS_DXEPCTL_EPTYP_BULK)){
        if (start_data_toggle == USB_FS_DXEPCTL_SD0PID_SEVNFRM) {
	        set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_SD0PID); /* DATA0 */
        }else{
            set_reg(r_CORTEX_M_USB_FS_DOEPCTL(ep), 1, USB_FS_DOEPCTL_SD1PID); /* DATA1 */
        }
    }
}

/**
 * \brief USB On-the-Go core RESET
 *
 */
static usb_ep_error_t usb_otg_fs_core_reset(void)
{

    int count = 0;
	/* Wait for AHB master idle */
	while (!get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_AHBIDL)){
        if (++count > USB_REG_CHECK_TIMEOUT)
		    printf("HANG! AHB Idle GRSTCTL:AHBIDL\n");
        return -USB_ERROR_BUSY;
    }

	/* Core soft reset */
	set_reg(r_CORTEX_M_USB_FS_GRSTCTL, 1, USB_FS_GRSTCTL_CSRST);
	while (get_reg(r_CORTEX_M_USB_FS_GRSTCTL, USB_FS_GRSTCTL_CSRST)){
        if (++count > USB_REG_CHECK_TIMEOUT){
		    printf("HANG! Core Soft RESET\n");
        }
        return -USB_ERROR_BUSY;
    }

	/* Wait for 3 PHY Clocks */
	unsigned int i;
	for (i = 0; i < 0xff; i++)
		continue;
    return 0;
}


/**
 * \brief Core initialization.
 *
 * See section 34.17.1 of the reference manual
 * The first thing to do is to active the PHY's transceiver (cf. 34.8)
 *
 * The application must perform the core initialization sequence. If the cable is connected
 * during power-up, the current mode of operation bit in the OTG_FS_GINTSTS (CMOD bit in
 * OTG_FS_GINTSTS) reflects the mode. The OTG_FS controller enters host mode when an
 * “A” plug is connected or device mode when a “B” plug is connected.
 *
 * This section explains the initialization of the OTG_FS controller after power-on. The
 * application must follow the initialization sequence irrespective of host or device mode
 * operation. All core global registers are initialized according to the core’s configuration:
 *
 * 1. Program the following fields in the OTG_FS_GAHBCFG register:
 *      – Global interrupt mask bit GINTMSK = 1
 *      – RxFIFO non-empty (RXFLVL bit in OTG_FS_GINTSTS)
 *      – Periodic TxFIFO empty level (can be enabled only when the core is operating in Slave mode)
 *
 * 2. Program the following fields in the OTG_FS_GUSBCFG register:
 *      – HNP capable bit
 *      – SRP capable bit
 *      – FS timeout calibration field
 *      – USB turnaround time field
 *
 * 3. The software must unmask the following bits in the OTG_FS_GINTMSK register:
 *      - OTG interrupt mask
 *      - Mode mismatch interrupt mask
 *
 * 4. The software can read the CMOD bit in OTG_FS_GINTSTS to determine whether the
 * OTG_FS controller is operating in host or device mode.
 */
static void usb_otg_fs_core_init(void)
{

    /* The first thing to do is to active the PHY's transceiver (cf. 34.8) : We are using the internal FS PHY */
	set_reg(r_CORTEX_M_USB_FS_GCCFG, 1, USB_FS_GCCFG_PWRDWN);
    set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 1, USB_FS_GUSBCFG_PHYSEL); /* Full Speed serial transceiver select */

    /* In device mode, just after Power On Reset or a Soft Reset,
     * the GINTSTS.Sof bit is set to 1'b1 for debug purposes.
     * This status must be cleared and can be ignored.
     */
    clear_reg_bits(r_CORTEX_M_USB_FS_GINTSTS, USB_FS_GINTSTS_SOF_Msk);


	/* [MR] TODO Read the User Hardware Configuration registers (GHWCFG1, 2, 3, and 4)
       to find the configuration parameters selected for DWC_otg core */

