wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
    /* Program the following fields in the Global AHB Configuration (GAHBCFG) register.
     *      - Global Interrupt Mask bit = 1
     *      - Periodic TxFIFO Empty Level (can be enabled only when the core is operating in Slave mode)
     */

	set_reg(r_CORTEX_M_USB_FS_GAHBCFG, 1, USB_FS_GAHBCFG_GINTMSK); /* Unmask the Global interrupt assertion to the application. */

    /* Non-periodic TxFIFO Empty Level (can be enabled only when the core is operating in Slave mode
     * as a host or as a device in Shared FIFO operation.)
     * Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
     * interrupts will occur when the TxFIFO is truly empty (not just half full).
      */
	set_reg(r_CORTEX_M_USB_FS_GAHBCFG, 0, USB_FS_GAHBCFG_TXFELVL);

    /* FIXME GAHBCFG Periodic TxFIFO empty level (PTXFELVL) is not set because it is only accessible in host mode.*/

    /*  RxFIFO non-empty (RXFLVL bit in OTG_FS_GINTSTS) */
	set_reg(r_CORTEX_M_USB_FS_GINTMSK, 1, USB_FS_GINTMSK_RXFLVLM); /* Unmask Receive FIFO non-empty */

	set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 0, USB_FS_GUSBCFG_HNPCAP); /* FIXME Device Only Configuration :  HNP capability is enabled. */

	set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 0, USB_FS_GUSBCFG_SRPCAP); /* FIXME Device Only Configuration :  SRP capability is not enabled. */

	set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 0, USB_FS_GUSBCFG_TOCAL); /* FS timeout calibration */
                       /*    The number of PHY clocks that the application programs in this field is added to the fullspeed
                        *    interpacket timeout duration in the core to account for any additional delays
                        *    introduced by the PHY. This can be required, because the delay introduced by the PHY in
                        *    generating the line state condition can vary from one PHY to another.
                        *    The USB standard timeout value for full-speed operation is 16 to 18 (inclusive) bit times.
                        *    FIXME The application must program this field based on the speed of enumeration.
                        *    The number of bit times added per PHY clock is 0.25 bit times.
                        */

	/* PHY clock is the same as AHB clock */
	set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 6, USB_FS_GUSBCFG_TRDT); /* USB turnaround time see TRDT values (DocID018909 Rev 15) */
                        /*  These bits allow setting the turnaround time in PHY clocks. They must be configured
                         *  according to Table 201: TRDT values, depending on the application AHB frequency.
                         *  Higher TRDT values allow stretching the USB response time to IN tokens in order
                         *  to compensate for longer AHB read access latency to the Data FIFO.
                         *   FIXME Only accessible in device mode.
                         */
	set_reg(r_CORTEX_M_USB_FS_GINTMSK, 1, USB_FS_GINTMSK_MMISM); /* Unmask  Mode mismatch interrupt */

    /* [MR] TODO The software can read the CMOD bit in OTG_FS_GINTSTS to determine whether the
     * OTG_FS controller is operating in host or device mode.
     */
}

/**
 *\brief Device initialization.
 *
 * See section 34.17.3 of the reference manual
 * The application must perform the following steps to initialize the core as a device on powerup
 * or after a mode change from host to device.
 *
 *
 * 1. Program the following fields in the OTG_FS_DCFG register:
 *      – Device speed
 *      – Non-zero-length status OUT handshake
 *      - Periodic Frame Interval (If Periodic Endpoints are supported)
 *                       FIXME PERIODIC ENDPPOINTS NOT SUPPORTED YET
 *                       See 7.1 Device Initialization (USB 2.0 Hi-Speed On-The-Go (OTG) Programmer’s Guide)
 * 2. Program the Device threshold control register. This is required only if you are using DMA mode and
 *    you are planning to enable thresholding. /!\ NOT USED HERE

 *
 * 3. Program the OTG_FS_GINTMSK register to unmask the following interrupts:
 *      – USB reset
 *      – Enumeration done
 *      – Early suspend
 *      – USB suspend
 *      – SOF
 *
 * 4. Clear the DCTL.SftDiscon bit. The core issues a connect after this bit is cleared.
 *                      See 7.1 Device Initialization (USB 2.0 Hi-Speed On-The-Go (OTG) Programmer’s Guide)
 *
 * 5. Program the VBUSBSEN bit in the OTG_FS_GCCFG register to enable VBUS sensing
 *    in “B” device mode and supply the 5 volts across the pull-up resistor on the DP line.
 *
 * 6. Wait for the USBRST interrupt in OTG_FS_GINTSTS. It indicates that a reset has been
 *    detected on the USB that lasts for about 10 ms on receiving this interrupt.
 *
 * 7. Wait for the ENUMDNE interrupt in OTG_FS_GINTSTS. This interrupt indicates the end of
 *    reset on the USB.
 *
 * At this point, the device is ready to accept SOF packets and perform control transfers on
 * control endpoint 0.
 *
 */
static void usb_otg_fs_device_init(void)
{

	set_reg(r_CORTEX_M_USB_FS_DCFG, 3, USB_FS_DCFG_DSPD);     /* Device speed: 3 = Full Speed */
	set_reg(r_CORTEX_M_USB_FS_DCFG, 0, USB_FS_DCFG_NZLSOHSK); /* Non-zero-length status OUT handshake: */
                            /* The application can use this field to select the handshake the core sends on receiving a
                             * nonzero-length data packet during the OUT transaction of a control transfer’s Status stage.
                             * 1: Send a STALL handshake on a nonzero-length status OUT transaction and do not send
                             * the received OUT packet to the application.
                             * 0: Send the received OUT packet to the application (zero-length or nonzero-length) and
                             * send a handshake based on the NAK and STALL bits for the endpoint in the Device
                             * endpoint control register
                             */

	set_reg_bits(r_CORTEX_M_USB_FS_GINTMSK,
                        USB_FS_GINTMSK_USBRST_Msk   | /* USB reset: The core sets this bit to indicate that a reset is detected on the USB. */
						USB_FS_GINTMSK_ENUMDNEM_Msk | /* Unmask Speed Enumeration done interupt */
						USB_FS_GINTMSK_ESUSPM_Msk   | /* Unmask Early suspend mask interupt */
						USB_FS_GINTMSK_USBSUSPM_Msk | /* Unmask USB suspend mask */
						//USB_FS_GINTMSK_SOFM_Msk     | /* Unmask Start of frame */
						USB_FS_GINTMSK_OEPINT_Msk   | /* FIXME Unmask OUT endpoints interrupt */
						USB_FS_GINTMSK_IEPINT_Msk);   /* FIXME Unmask IN endpoints interrupt */

	set_reg(r_CORTEX_M_USB_FS_GCCFG, 1, USB_FS_GCCFG_VBUSBSEN); /* Enable the VBUS sensing “B” device */

    usb_fs_driver_device_connect();
}


static void usb_fs_init_isr_handlers(void);

/**
 * \brief Inititialize USB driver.
 *
 * Launch needeed initialization functions.
 * Before sys_init(INIT_DONE)
 */
void usb_fs_driver_early_init(void (*data_received)(uint32_t), void (*data_sent)(void))
{
	usb_fs_callbacks.data_sent_callback = data_sent;
	usb_fs_callbacks.data_received_callback = data_received;

