wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
	usb_device_early_init();

	usb_fs_init_isr_handlers();

	//NVIC_EnableIRQ(OTG_FS_IRQn);
}


static void ep_init_reset(void);

/*
 *
 * After sys_init(INIT_DONE)
 */
void usb_fs_driver_init(void)
{
	usb_otg_fs_core_init();
	set_reg(r_CORTEX_M_USB_FS_GUSBCFG, 1, USB_FS_GUSBCFG_FDMOD); /* FIXME Force device mode */
	usb_otg_fs_device_init();
}


/**
 * \brief Read FIFO.
 *
 * Read data put in the FIFO.
 *
 * @param dest Destination address
 * @param size Size of the data
 * @param ep Endpoint from where data is read
 */
static void _read_fifo(volatile uint8_t *dest, volatile uint32_t size, uint8_t ep)
{
	assert(ep <= 1);
	assert(size <= USB_FS_RX_FIFO_SZ);


	uint32_t i = 0;
	uint32_t size_4bytes = size / 4;

    uint32_t oldmask = read_reg_value(r_CORTEX_M_USB_FS_GINTMSK);
    set_reg_value(r_CORTEX_M_USB_FS_GINTMSK, 0, 0xffffffff, 0);

    // FIXME: IP should has its own interrupts disable during ISR execution
	//disable_irq();

	for (i = 0; i < size_4bytes; i++, dest += 4){
		*(uint32_t *)dest = *USB_FS_DEVICE_FIFO(ep);
	}

	switch (size % 4) {
	case 1:
		*dest = *USB_FS_DEVICE_FIFO(ep) & 0xff;
		break;
	case 2:
		*(uint16_t *)dest = *USB_FS_DEVICE_FIFO(ep) & 0xffff;
		break;
	case 3:
		*(uint32_t *)dest = *USB_FS_DEVICE_FIFO(ep) & 0xffffff;
		break;
	default:
		break;
	}

    // FIXME: IP should has its own interrupts disable during ISR execution
	//enable_irq();
    set_reg_value(r_CORTEX_M_USB_FS_GINTMSK, oldmask, 0xffffffff, 0);
}

static void read_fifo(volatile uint8_t *dest, volatile uint32_t size, uint8_t ep)
{
	unsigned int i;
	unsigned int num = size / USB_FS_RX_FIFO_SZ;


	for(i = 0; i < num; i++){
		_read_fifo(dest + (i * USB_FS_RX_FIFO_SZ), USB_FS_RX_FIFO_SZ, ep);
	}
	/* Handle the possible last packet */
	if(size > (num * USB_FS_RX_FIFO_SZ)){
		_read_fifo(dest + (num * USB_FS_RX_FIFO_SZ), size - (num * USB_FS_RX_FIFO_SZ), ep);
	}
}

/**
 * \brief Receive FIFO packet read.
 *
 */
static void usb_fs_driver_rcv_out_pkt(volatile uint8_t *buffer,
                                      volatile uint32_t *buffer_idx,
                                     volatile  uint32_t buffer_size,
                                    volatile uint32_t bcnt,
                                    usb_ep_nb_t epnum)
{
	uint32_t size;
	assert(buffer);
	size = (bcnt + *buffer_idx) >= buffer_size ? (buffer_size - *buffer_idx) : bcnt;
	read_fifo(buffer + *buffer_idx, size, epnum);
	*buffer_idx += size;
}


/*
 * IRQs
 */
void (* usb_fs_isr_handlers[USB_MAX_ISR])(void);
/**
 * \brief Handler for RXFLVL interrupt.
 *
 *   Packet read
 *   This section describes how to read packets (OUT data and SETUP packets) from the
 *   receive FIFO.
 *      1.  On catching an RXFLVL interrupt (OTG_FS_GINTSTS register), the application must
 *          read the Receive status pop register (OTG_FS_GRXSTSP).
 *      2.  The application can mask the RXFLVL interrupt (in OTG_FS_GINTSTS) by writing to
 *          RXFLVL = 0 (in OTG_FS_GINTMSK), until it has read the packet from the receive
 *          FIFO.
 *      3.  If the received packet’s byte count is not 0, the byte count amount of data is popped
 *          from the receive Data FIFO and stored in memory. If the received packet byte count is
 *          0, no data is popped from the receive data FIFO.
 *      4.  The receive FIFO’s packet status readout indicates one of the following:
 *          a) Global OUT NAK pattern:
 *              PKTSTS = Global OUT NAK, BCNT = 0x000, EPNUM = Don’t Care (0x0),
 *              DPID = Don’t Care (0b00).
 *              These data indicate that the global OUT NAK bit has taken effect.
 *          b) SETUP packet pattern:
 *              PKTSTS = SETUP, BCNT = 0x008, EPNUM = Control EP Num, DPID = D0.
 *              These data indicate that a SETUP packet for the specified endpoint is now
 *              available for reading from the receive FIFO.
 *          c) Setup stage done pattern:
 *              PKTSTS = Setup Stage Done, BCNT = 0x0, EPNUM = Control EP Num,
 *              DPID = Don’t Care (0b00).
 *              These data indicate that the Setup stage for the specified endpoint has completed
 *              and the Data stage has started. After this entry is popped from the receive FIFO,
 *              the core asserts a Setup interrupt on the specified control OUT endpoint.
 *          d) Data OUT packet pattern:
 *              PKTSTS = USB_OUT_PACKET_RECEIVED, BCNT = size of the received data OUT packet (0 ≤ BCNT
 *              ≤ 1 024), EPNUM = EPNUM on which the packet was received, DPID = Actual
 *              Data PID.
 *          e) Data transfer completed pattern:
 *              PKTSTS = Data OUT Transfer Done, BCNT = 0x0, EPNUM = OUT EP Num
 *              on which the data transfer is complete, DPID = Don’t Care (0b00).
 *              These data indicate that an OUT data transfer for the specified OUT endpoint has
 *              completed. After this entry is popped from the receive FIFO, the core asserts a
 *              Transfer Completed interrupt on the specified OUT endpoint.
 *      5.  After the data payload is popped from the receive FIFO, the RXFLVL interrupt
 *          (OTG_FS_GINTSTS) must be unmasked.
 *      6.  Steps 1–5 are repeated every time the application detects assertion of the interrupt line
 *          due to RXFLVL in OTG_FS_GINTSTS.
 *
 *      /!\ Reading an empty receive FIFO can result in undefined core behavior.
 *
 */
static void rxflvl_handler(void)
{
	uint32_t grxstsp;
	uint32_t pktsts;
	uint32_t bcnt;
	uint32_t epnum;
	uint32_t dpid;
	uint32_t size;

   	/* 2. Mask the RXFLVL interrupt (in OTG_FS_GINTSTS) by writing to RXFLVL = 0 (in OTG_FS_GINTMSK),
     	 *    until it has read the packet from the receive FIFO
     	 */
//	set_reg(r_CORTEX_M_USB_FS_GINTMSK, 0, USB_FS_GINTMSK_RXFLVLM);

 	/* 1. Read the Receive status pop register */
    	grxstsp = read_reg_value(r_CORTEX_M_USB_FS_GRXSTSP);

    	/* FIXME grxstsp content must be interprited diferently in host and device mode.
     	 *       We only support device mode so far.
     	 */
	pktsts = (grxstsp & 0x1e0000) >> 17;// FIXME we should define a macro
	dpid = (grxstsp & 0x18000) >> 15;   // FIXME we should define a macro && XXX Should dpid become a global ?
	bcnt = (grxstsp & 0x7ff0) >> 4;     // FIXME we should define a macro
	epnum = grxstsp & 0xf;       // FIXME we should define a macro
	size = 0;
	//printf("EP:%d, PKTSTS:%x, BYTES_COUNT:%x,  DATA_PID:%x\n", epnum, pktsts, bcnt, dpid);


    /* 3. If the received packet’s byte count is not 0, the byte count amount of data is popped
     *    from the receive Data FIFO and stored in memory. If the received packet byte count is
     *    0, no data is popped from the receive data FIFO.
     *
     *   /!\ Reading an empty receive FIFO can result in undefined core behavior.
     */
    if (bcnt != ZERO_LENGTH_PACKET){

