wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
        /* 4. The receive FIFO’s packet status readout indicates one of the following: */
	    switch (epnum) {
	        case USB_FS_DXEPCTL_EP0:
		        /* b) SETUP packet pattern
       	         	 *      These data indicate that a SETUP packet for the specified endpoint is now
       	    	         *      available for reading from the receive FIFO.
                	 */
		        if (pktsts == SETUP && bcnt == 0x8 && dpid == 0) {
			        read_fifo(setup_packet, 8, epnum);
                                                    /* After this, the Data stage begins.
				                     * A Setup stage done is received,
				                     * which triggers a Setup interrupt
				                     */
		        }
	                /* c) Setup stage done pattern
        	        *      These data indicate that the Setup stage for the specified endpoint has completed
                	*      and the Data stage has started. After this entry is popped from the receive FIFO,
	                *      the core asserts a Setup interrupt on the specified control OUT endpoint.
    		        */
	                if (pktsts == SETUP_Done){
       		             printf("EP0 Setup stage done pattern\n");
       		         }
               		 /* d) Data OUT packet pattern */
			if (pktsts == DataOUT && bcnt > 0) {
       		             usb_fs_driver_rcv_out_pkt(buffer_ep0, &buffer_ep0_idx, buffer_ep0_size, bcnt, epnum);
			}
			break;
	        case USB_FS_DXEPCTL_EP1:
		        assert(buffer_ep1);
			usb_fs_driver_rcv_out_pkt(buffer_ep1, &buffer_ep1_idx, buffer_ep1_size, bcnt, epnum);

		        break;
	        default:
		        printf("RXFLVL on bad EP %d!", epnum);
	        }
	    }

    /* a) Global OUT NAK pattern (triggers an interrupt)
     *      These data indicate that the global OUT NAK bit has taken effect.
     */
    if (pktsts == OUT_NAK){
        printf("Global OUT NAK pattern on EP%d\n", epnum);
    }

    /* e) Data transfer completed pattern (triggers an interrupt)
     *      These data indicate that an OUT data transfer for the specified OUT endpoint has
     *      completed. After this entry is popped from the receive FIFO, the core asserts a
     *      Transfer Completed interrupt on the specified OUT endpoint.
     */
    if (pktsts == DataOUT){
        //printf("OUT Data transfer completed pattern on EP%d\n", epnum);
    }

	set_reg(r_CORTEX_M_USB_FS_GINTMSK, 1, USB_FS_GINTMSK_RXFLVLM);

}


/**
 *\brief Endpoint initialization reset.
 *
 * See section 34.17.5 of the reference manual
 *
 * Endpoint initialization on USB reset
 * 1. Set the NAK bit for all OUT endpoints
 *      – SNAK = 1 in OTG_FS_DOEPCTLx (for all OUT endpoints)
 *
 * 2. Unmask the following interrupt bits
 *      – INEP0 = 1 in OTG_FS_DAINTMSK (control 0 IN endpoint)
 *      – OUTEP0 = 1 in OTG_FS_DAINTMSK (control 0 OUT endpoint)
 *      – STUP = 1 in DOEPMSK
 *      – XFRC = 1 in DOEPMSK
 *      – XFRC = 1 in DIEPMSK
 *      – TOC = 1 in DIEPMSK
 *
 * 3. Set up the Data FIFO RAM for each of the FIFOs
 *      – Program the OTG_FS_GRXFSIZ register, to be able to receive control OUT data
 *        and setup data. If thresholding is not enabled, at a minimum, this must be equal to
 *        1 max packet size of control endpoint 0 + 2 Words (for the status of the control
 *        OUT data packet) + 10 Words (for setup packets).
 *      – Program the OTG_FS_TX0FSIZ register (depending on the FIFO number chosen)
 *        to be able to transmit control IN data. At a minimum, this must be equal to 1 max
 *        packet size of control endpoint 0.
 *
 *
 * At this point, all initialization required to receive SETUP packets is done.
 *
 */
static void ep_init_reset(void)
{
#if 1
    // FIXME MR We should check if the ep is IN/OUT
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP0), 1, USB_FS_DOEPCTL_SNAK);
    //set_reg(r_CORTEX_M_USB_FS_DOEPCTL(1), 1, USB_FS_DOEPCTL_SNAK);
#else
    /* 1. Set the NAK bit for all OUT endpoints
     *      – SNAK = 1 in OTG_FS_DOEPCTLx (for all OUT endpoints)
     */
    uint8_t i = 0;
    for (i=0;i<=PROD_MAX_USB_ENDPOINTS;i++){
        set_reg(r_CORTEX_M_USB_FS_DOEPCTL(i), 1, USB_FS_DOEPCTL_SNAK);
    }
#endif

    /*
     * 2. Unmask the following interrupt bits
     *      – INEP0 = 1 in OTG_FS_DAINTMSK (control 0 IN endpoint)
     *      – OUTEP0 = 1 in OTG_FS_DAINTMSK (control 0 OUT endpoint)
     *      – STUP = 1 in DOEPMSK
     *      – XFRC = 1 in DOEPMSK
     *      – XFRC = 1 in DIEPMSK
     *      – TOC = 1 in DIEPMSK
     */

	write_reg_value(r_CORTEX_M_USB_FS_DAINTMSK,	USB_FS_DAINTMSK_IEPM(USB_FS_DXEPCTL_EP0)
                                                | USB_FS_DAINTMSK_IEPM(USB_FS_DXEPCTL_EP2)
                                                | USB_FS_DAINTMSK_OEPM(USB_FS_DXEPCTL_EP0)
                                                | USB_FS_DAINTMSK_OEPM(USB_FS_DXEPCTL_EP1));

	set_reg(r_CORTEX_M_USB_FS_DOEPMSK, 1, USB_FS_DOEPMSK_STUPM);
	set_reg(r_CORTEX_M_USB_FS_DOEPMSK, 1, USB_FS_DOEPMSK_XFRCM);
	set_reg(r_CORTEX_M_USB_FS_DIEPMSK, 1, USB_FS_DIEPMSK_XFRCM);
	set_reg(r_CORTEX_M_USB_FS_DIEPMSK, 1, USB_FS_DIEPMSK_TOM);



    /*
     * 3. Set up the Data FIFO RAM for each of the FIFOs
     *      – Program the OTG_FS_GRXFSIZ register, to be able to receive control OUT data
     *        and setup data. If thresholding is not enabled, at a minimum, this must be equal to
     *        1 max packet size of control endpoint 0 + 2 Words (for the status of the control
     *        OUT data packet) + 10 Words (for setup packets).
     *
     * See reference manual section 34.11 for peripheral FIFO architecture.
	 * XXX: The sizes of TX FIFOs seems to be the size of TX FIFO #0 for
	 * all FIFOs. We don't know if it is really the case or if the DTXFSTS
	 * register does not give the free space for the right FIFO.
	 *
	 * 0                512                1024
	 * +-----------------+------------------+-----------------+
	 * |     RX FIFO     |     TX0 FIFO     | TX1 FIFO (EP 2) |
	 * |    128 Words    |    128 Words     |    128 Words    |
	 * +-----------------+------------------+-----------------+
     *
	 */
	set_reg(r_CORTEX_M_USB_FS_GRXFSIZ, USB_FS_RX_FIFO_SZ, USB_FS_GRXFSIZ_RXFD);

