wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
    /*      – Program the OTG_FS_TX0FSIZ register (depending on the FIFO number chosen)
     *        to be able to transmit control IN data. At a minimum, this must be equal to 1 max
     *        packet size of control endpoint 0.
     *
     *      XXX: The register 'Enpoint 0 Transmit FIFO size' is called OTG_FS_TX0FSIZ in
     *            section 34.17.5 of the reference manual but it is called OTG_FS_DIEPTXF0 in the section 34.16.2.
     */

     /*
     EndPoint 0 TX FIFO configuration (should store a least 4 64byte paquets
     */
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF0, USB_FS_TX_FIFO_SZ, USB_FS_DIEPTXF_INEPTXSA);
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF0, 64, USB_FS_DIEPTXF_INEPTXFD);

    /*
     * 4. Program STUPCNT in the endpoint-specific registers for control OUT endpoint 0 to receive a SETUP packet
     *      – STUPCNT = 3 in OTG_FS_DOEPTSIZ0 (to receive up to 3 back-to-back SETUP packets)
     */

	set_reg(r_CORTEX_M_USB_FS_DOEPTSIZ(USB_FS_DXEPCTL_EP0), 3, USB_FS_DOEPTSIZ_STUPCNT);
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP0), 1, USB_FS_DOEPCTL_CNAK);
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP0), 1, USB_FS_DOEPCTL_EPENA);

	/*********** Set endpoints 0x82 (IN EP) ************/
#if 0
    usb_driver_in_endpoint_activate(USB_FS_DXEPCTL_EP2,(64 * 4 + 128 * 4), USB_FS_DXEPCTL_EPTYP_BULK, USB_FS_DIEPCTL_SD0PID, 64);
#else
    /*  Transmit FIFO address */
    /* FIXME TxFIFO number */
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF(USB_FS_DXEPCTL_EP2), USB_FS_RX_FIFO_SZ + USB_FS_TX_FIFO_SZ, USB_FS_DIEPTXF_INEPTXSA);
	set_reg(r_CORTEX_M_USB_FS_DIEPTXF(USB_FS_DXEPCTL_EP2), USB_FS_TX_FIFO_SZ, USB_FS_DIEPTXF_INEPTXFD);

    /* Maximum packet size */
	set_reg_value(r_CORTEX_M_USB_FS_DIEPCTL(USB_FS_DXEPCTL_EP2), MAX_DATA_PACKET_SIZE, USB_FS_DIEPCTL_MPSIZ_Msk(USB_FS_DXEPCTL_EP2), USB_FS_DIEPCTL_MPSIZ_Pos(USB_FS_DXEPCTL_EP2));

    /* Start data toggle */
    set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP2), 1, USB_FS_DIEPCTL_SD0PID);

    /* Endpoint type */
	set_reg(r_CORTEX_M_USB_FS_DIEPCTL(USB_FS_DXEPCTL_EP2), USB_FS_DIEPCTL_EPTYP_BULK, USB_FS_DIEPCTL_EPTYP);

	/*  USB active endpoint XXX: should it be done after a SET_CONFIGURATION ? */
	set_reg_bits(r_CORTEX_M_USB_FS_DIEPCTL(USB_FS_DXEPCTL_EP2), USB_FS_DIEPCTL_USBAEP_Msk);

#endif



	/************ Set endpoint 0x1 (OUT EP) ************/
#if 0
    usb_driver_out_endpoint_activate(USB_FS_DXEPCTL_EP1, //FIFO NUM, USB_FS_DXEPCTL_EPTYP_BULK, USB_FS_DOEPCTL_SD0PID, 64);
#else

    /* Maximum packet size */
	set_reg_value(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP1), MAX_DATA_PACKET_SIZE, USB_FS_DOEPCTL_MPSIZ_Msk(USB_FS_DXEPCTL_EP1), USB_FS_DOEPCTL_MPSIZ_Pos(USB_FS_DXEPCTL_EP1));

    /* FIXME Start data toggle */
    set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP1), 1, USB_FS_DOEPCTL_SD0PID);

    /* Endpoint type */
	set_reg(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP1), USB_FS_DOEPCTL_EPTYP_BULK, USB_FS_DOEPCTL_EPTYP);

    /*  USB active endpoint */
	set_reg_bits(r_CORTEX_M_USB_FS_DOEPCTL(USB_FS_DXEPCTL_EP1), USB_FS_DOEPCTL_USBAEP_Msk);

#endif
}


/**
 * \brief Endpoint initialization on enumeration completion.
 *
 *  1. On the Enumeration Done interrupt (ENUMDNE in OTG_FS_GINTSTS), read the OTG_FS_DSTS register
 *     to determine the enumeration speed.
 *  2. Program the MPSIZ field in OTG_FS_DIEPCTL0 to set the maximum packet size. This
 *     step configures control endpoint 0. The maximum packet size for a control endpoint
 *     depends on the enumeration speed.
 *
 *  At this point, the device is ready to receive SOF packets and is configured to perform control
 *  transfers on control endpoint 0
 */
volatile uint32_t badspeed = 0;

static void ep_init_enum(void)
{
	/* 1. read the OTG_FS_DSTS register to determine the enumeration speed. */
	uint8_t speed = get_reg(r_CORTEX_M_USB_FS_DSTS, USB_FS_DSTS_ENUMSPD);
	if (speed != USB_FS_DSTS_ENUMSPD_FS) {
        badspeed++;
		//return;
	}

	////LOG("Enum speed: FS => MAX PACKET SIZE = 64\n");
    /* TODO Program the MPSIZ field in OTG_FS_DIEPCTL0 to set the maximum packet size. This
     * step configures control endpoint 0.
     */
	set_reg_value(r_CORTEX_M_USB_FS_DIEPCTL(USB_FS_DXEPCTL_EP0),
		      USB_FS_DIEPCTL0_MPSIZ_64BYTES,
		      USB_FS_DIEPCTL_MPSIZ_Msk(USB_FS_DXEPCTL_EP0),
		      USB_FS_DIEPCTL_MPSIZ_Pos(USB_FS_DXEPCTL_EP0));
   return;
}


/**
 * \brief Input interrupt handler.
 *
 * Handles an input interrupt.
 * The peripheral core provides the following status checks and interrupt generation:
 * • Transfer completed interrupt, indicating that data transfer was completed on both the application (AHB) and USB sides
 * • Setup stage has been done (control-out only)
 * • Associated transmit FIFO is half or completely empty (in endpoints)
 * • NAK acknowledge has been transmitted to the host (isochronous-in only)
 * • IN token received when Tx-FIFO was empty (bulk-in/interrupt-in only)
 * • Out token received when endpoint was not yet enabled
 * • Babble error condition has been detected
 * • Endpoint disable by application is effective
 * • Endpoint NAK by application is effective (isochronous-in only)
 * • More than 3 back-to-back setup packets were received (control-out only)
 * • Timeout condition detected (control-in only)
 * • Isochronous out packet has been dropped, without generating an interrupt
 */
static void iepint_handler(void)
{
    /*  read the device all endpoints interrupt (OTG_FS_DAINT) register to get the exact endpoint number
     *  for the Device endpoint-x interrupt register.
     */
	uint32_t daint = read_reg_value(r_CORTEX_M_USB_FS_DAINT);

	if (daint & USB_FS_DAINT_IEPINT(USB_FS_DXEPCTL_EP0)) {
		uint32_t diepint0 = read_reg_value(r_CORTEX_M_USB_FS_DIEPINT(USB_FS_DXEPCTL_EP0));

        /* Bit 7 TXFE: Transmit FIFO empty */
		if (diepint0 & USB_FS_DIEPINT_TOC_Msk) {
			set_reg_bits(r_CORTEX_M_USB_FS_DIEPINT(USB_FS_DXEPCTL_EP0), USB_FS_DIEPINT_TXFE_Msk);
		}

        /* Bit 6 INEPNE: IN endpoint NAK effective */
		if (diepint0 & USB_FS_DIEPINT_INEPNE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_FS_DIEPINT(USB_FS_DXEPCTL_EP0), USB_FS_DIEPINT_INEPNE_Msk);
		}

        /* Bit 4 ITTXFE: IN token received when TxFIFO is empty */
		if (diepint0 & USB_FS_DIEPINT_ITTXFE_Msk) {
			set_reg_bits(r_CORTEX_M_USB_FS_DIEPINT(USB_FS_DXEPCTL_EP0), USB_FS_DIEPINT_ITTXFE_Msk);
		}

