wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_fs.c
/* Split the data to send in 128 bytes max packets */
static void write_fifo(const void *src, uint32_t size, uint8_t ep)
{
	unsigned int i;
	unsigned int num = size / USB_FS_TX_FIFO_SZ;

	for(i = 0; i < num; i++){
		_write_fifo(src + (i * USB_FS_TX_FIFO_SZ), USB_FS_TX_FIFO_SZ, ep);
	}
	/* Handle the possible last packet */
	if(size > (num * USB_FS_TX_FIFO_SZ)){
		_write_fifo(src + (num * USB_FS_TX_FIFO_SZ), size - (num * USB_FS_TX_FIFO_SZ), ep);
	}

}

void usb_fs_driver_send_zlp(uint8_t ep){

    /* 1. Program the OTG_FS_DIEPTSIZx register for the transfer size and the corresponding packet count. */
    set_reg_value(r_CORTEX_M_USB_FS_DIEPTSIZ(ep), 1, USB_FS_DIEPTSIZ_PKTCNT_Msk(ep), USB_FS_DIEPTSIZ_PKTCNT_Pos(ep));
    set_reg_value(r_CORTEX_M_USB_FS_DIEPTSIZ(ep), 0, USB_FS_DIEPTSIZ_XFRSIZ_Msk(ep), USB_FS_DIEPTSIZ_XFRSIZ_Pos(ep));

    /* 2. Enable endpoint for transmission. */
    set_reg_bits(r_CORTEX_M_USB_FS_DIEPCTL(ep), USB_FS_DIEPCTL_CNAK_Msk | USB_FS_DIEPCTL_EPENA_Msk);

}

/**
 * \brief Function to handle send call.
 *
 * Set register correctly for the device to send data to host next.
 * This is NOT where the actual sending is done.
 *
 * @param src Source adress
 * @param size Size of data
 * @param ep Endpoint used
 */
void usb_fs_driver_send(const void *src, uint32_t size, uint8_t ep)
{
    uint32_t packet_count = 0;

    /* FIXME Only sending data from IN endpoints is implemented */
    if (src == NULL){
        usb_fs_driver_send_zlp(ep);
        return;
    }
    /* Program the transfer size and packet count as follows:
     *      xfersize = N * maxpacket + short_packet pktcnt = N + (short_packet exist ? 1 : 0)
     */
    packet_count = size / MAX_DATA_PACKET_SIZE + (size & (MAX_DATA_PACKET_SIZE-1) ? 1 : 0);

    /* 1. Program the OTG_FS_DIEPTSIZx register for the transfer size and the corresponding packet count. */
    set_reg_value(r_CORTEX_M_USB_FS_DIEPTSIZ(ep), packet_count, USB_FS_DIEPTSIZ_PKTCNT_Msk(ep), USB_FS_DIEPTSIZ_PKTCNT_Pos(ep));
    set_reg_value(r_CORTEX_M_USB_FS_DIEPTSIZ(ep), size, USB_FS_DIEPTSIZ_XFRSIZ_Msk(ep), USB_FS_DIEPTSIZ_XFRSIZ_Pos(ep));

    /* 2. Enable endpoint for transmission. */
    set_reg_bits(r_CORTEX_M_USB_FS_DIEPCTL(ep), USB_FS_DIEPCTL_CNAK_Msk | USB_FS_DIEPCTL_EPENA_Msk);


   /* The application can write multiple packets for the same
    * endpoint into the transmit FIFO, if space is available.
    * /!\ FIXME For periodic IN endpoints, the application must
    *     write packets only for one microframe.
    *     It can write packets for the next periodic transaction
    *     only after getting transfer complete for the previous transaction.
    */
    write_fifo(src, size, ep);
    //FIXME activate TXEMPTY intrrupt in DIEPEMPMSK register
}

/**
 * \brief Function to handle read call.
 *
 * Set register correctly for the device to read data from host next.
 * This is NOT where the actual reading is done.
 *
 * @param src Source adress
 * @param size Size of data
 * @param ep Endpoint used
 */
void usb_fs_driver_read(void *dst, uint32_t size, uint8_t ep)
{
	if (ep == USB_FS_DXEPCTL_EP0 && dst != NULL) {
		assert(!buffer_ep0);
		buffer_ep0 = dst;
		buffer_ep0_idx = 0;
		buffer_ep0_size = size;

//	uint32_t packet_count = size / MAX_DATA_PACKET_SIZE + (size & (MAX_DATA_PACKET_SIZE-1) ? 1 : 0);
//	set_reg_value(r_CORTEX_M_USB_FS_DOEPTSIZ(ep), packet_count, USB_FS_DOEPTSIZ_PKTCNT_Msk(ep), USB_FS_DOEPTSIZ_PKTCNT_Pos(ep));


	}

	if (ep == USB_FS_DXEPCTL_EP1 && dst != NULL) {
		assert(dst);
		assert(!buffer_ep1);
		buffer_ep1 = dst;
		buffer_ep1_idx = 0;
		buffer_ep1_size = size;
	}

	/* Set the packet count number in the PKTCNT field */
	uint32_t packet_count = size / MAX_DATA_PACKET_SIZE + (size & (MAX_DATA_PACKET_SIZE-1) ? 1 : 0);
	set_reg_value(r_CORTEX_M_USB_FS_DOEPTSIZ(ep), packet_count, USB_FS_DOEPTSIZ_PKTCNT_Msk(ep), USB_FS_DOEPTSIZ_PKTCNT_Pos(ep));
	/* Set the size in the XFRSIZ field */
	set_reg_value(r_CORTEX_M_USB_FS_DOEPTSIZ(ep), size, USB_FS_DOEPTSIZ_XFRSIZ_Msk(ep), USB_FS_DOEPTSIZ_XFRSIZ_Pos(ep));

	set_reg_bits(r_CORTEX_M_USB_FS_DOEPCTL(ep), USB_FS_DOEPCTL_CNAK_Msk);

}

/**
 * \brief Set adress.
 */
void usb_fs_driver_set_address(uint16_t addr)
{
	set_reg(r_CORTEX_M_USB_FS_DCFG, addr, USB_FS_DCFG_DAD);
}
#endif
